var loc_data = {
  "地区": {
    "新课标一卷": ['山东', '河南', '河北', '山西', '江西', '湖北', '湖南', '广东', '安徽', '福建'],
    "新课标二卷": ['甘肃', '青海', '内蒙古', '黑龙江', '吉林', '辽宁', '宁夏', '新疆', '陕西', '重庆'],
    "新课标三卷": ['云南','广西','贵州','四川','西藏'],
    "自主命题": ["北京", "天津", "上海", "江苏", "浙江"],
  },
  "院校": {
    "北京": ["清华大学", "北京大学", "中国科学院大学", "中国人民大学", "北京航空航天大学","北京理工大学","北京师范大学",'北京邮电大学',"北京交通大学","中央民族大学","北京化工大学","北京工业大学" ],
    "上海": ["复旦大学", "上海交通大学", "同济大学","上海财经大学","华东师范大学","华东理工大学","华东政法大学","上海大学","东华大学","上海师范大学","上海海洋大学","上海科技大学","上海纽约大学","上海音乐学院"],
    "广东": ['中山大学','华南理工大学',"华南农业大学","华南师范大学","广州大学"],
    "香港": ["香港大学", "香港城市大学", "香港中文大学(深圳)", "香港浸会大学","香港理工大学","香港教育学院"],
    "天津": ['天津大学','南开大学'],
    "江苏": ["南京大学", "东南大学", "苏州大学","南京理工大学", "南京师范大学", "河海大学", "南京农业大学","南京航空航天大学"],
    "浙江": ["浙江大学", "杭州电子科技大学", "浙江工业大学","浙江师范大学",
    "杭州师范大学"],
    '安徽': ['中国科学技术大学','安徽大学','合肥工业大学'],
    "湖北": ["武汉大学", "华中科技大学", "武汉理工大学", "华中师范大学","华中农业大学",'中南财经政法大学','中南民族大学'],
    "湖南": ["国防科学技术大学", "中南大学", "湖南大学", "湖南师范大学", "长沙理工大学","衡阳师范学院","湘潭大学","中南林业科技大学"],
    '河北': ['河北大学','燕山大学','河北工业大学','河北师范大学'],
    '河南': ['郑州大学','河南大学','河南科技大学','河南工业大学','河南理工大学','河南农业大学'],
    "四川": ["四川大学", "电子科技大学", "西南交通大学", "西南财经大学", "四川农业大学", "四川师范大学","成都理工大学"],
    "陕西": ["西安交通大学", "西北工业大学", "西安电子科技大学","长安大学"],
    "吉林":["吉林大学","东北师范大学","长春理工大学","东北电力大学","延边大学","吉林农业大学","长春工业大学","北华大学","吉林师范大学","吉林财经大学"],
    "黑龙江": ["哈尔滨工业大学", "哈尔滨工程大学", "东北林业大学", "黑龙江大学","哈尔滨医科大学"],
    "辽宁": ['大连理工大学',"大连海事大学","东北大学","辽宁大学","东北财经大学"],
    "福建": ['厦门大学',"福州大学","福建师范大学","福建农林大学","华侨大学","集美大学"],
    "广西": ["广西大学","桂林电子科技大学","桂林理工大学","广西医科大学","广西师范大学"],
    "云南":['云南大学','昆明理工大学',"云南师范大学","云南民族大学"],
    "甘肃": ['兰州大学','西北师范大学','兰州交通大学','兰州理工大学','西北民族大学','甘肃农业大学'],
    '新疆': ['新疆大学','石河子大学','新疆财经大学'],
    '青海': ['青海大学','青海师范大学','青海民族大学'],
  }
};


function getLoc() {
  return loc_data;
}

module.exports = {
  getLoc: getLoc
}